use mermaid.js for ul diagrams
